# Where apps get installed
cask_args appdir: '/Applications'

# Taps we need to make this all work
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# mas to work with Apps from AppStore
brew "mas"

cask "zoomus" # zoom for video calls


# Web Apps
cask "brave-browser"
cask "google-chrome"
cask "firefox"
cask "tor-browser"
cask "transmission"

# WiFi and Bluetooth tools
brew "blueutil"

# Main system packages and tools
brew "zsh"
brew "antibody"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "gpg"
brew "wget"
brew "fzf"
brew "gawk"
brew "git"
brew "htop"
brew "telnet"
cask "cleanmymac"

# Python Development
brew "python"
brew "pyenv"
brew "nvm"
brew "npm"
cask "docker"
brew "docker-clean"  # Clean Docker containers, images, networks, and volumes
brew "poetry"

# Pandoc to work with PDFs
brew "librsvg"
cask "basictex"
brew "pandoc"

# Fonts
cask "font-fira-code"
cask "font-roboto-mono"

# Dev IDEs and tools
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "pycharm"
cask "postman"
cask "kite"
cask "sourcetree"  # xattr -d com.apple.quarantine /Applications/SourceTree.app

# Images/Photos/Video/Media
cask 'vlc'
cask "gimp"

# Ease your life
cask "notion"  # Notion for notes and ideas management
cask "hyper"  # Electron based terminal
cask "maccy"  # Clipboard manager for macOS (NB! Won't work on Catalina as of 05/2020 run xattr -d com.apple.quarantine /Applications/Maccy.app)
cask "rectangle"  # window management app based on Spectacle
brew "grsync"  # GUI for rsync

cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"

# Install Mac App Store Apps
mas "Cleaner-App", id: 1013897218
mas "DeskCover", id: 1257711898
mas "Instastats", id: 1017165214
mas "LastPass", id: 926036361
mas "Trello", id: 1278508951

mas "Slack", id: 803453959
mas "Telegram Lite", id: 946399090
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723

mas "Xcode", id: 497799835

